/*
 * 10242 Fourth Point !!
 * 輸入平行四邊形上不平行的兩個邊上的兩個端點，即輸入平行四邊形上三個端點，輸出平行四邊形剩下的端點
 * 輸入:
 * 0.000 0.000 0.000 1.000 0.000 1.000 1.000 1.000
 * 1.000 0.000 3.500 3.500 3.500 3.500 0.000 1.000
 * 1.866 0.000 3.127 3.543 3.127 3.543 1.412 3.145
 * 輸出:
 * 1.000 0.000
 * -2.500 -2.500
 * 0.151 -0.398
 */

#include <iostream>

using namespace std;

int main() {
    double x[4], y[4], X, Y;
    while (cin >> x[0] >> y[0] >> x[1] >> y[1] >> x[2] >> y[2] >> x[3] >> y[3]) {
        if (x[0] == x[2] && y[0] == y[2]) {
            X = x[1] + x[3] - x[0];
            Y = y[1] + y[3] - y[0];
        } else if (x[0] == x[3] && y[0] == y[3]) {
            X = x[1] + x[2] - x[0];
            Y = y[1] + y[2] - y[0];
        } else if (x[1] == x[2] && y[1] == y[2]) {
            X = x[0] + x[3] - x[1];
            Y = y[0] + y[3] - y[1];
        } else if (x[1] == x[3] && y[1] == y[3]) {
            X = x[0] + x[2] - x[1];
            Y = y[0] + y[2] - y[1];
        }
        cout.setf(ios::fixed);
        cout.setf(ios::showpoint);
        cout.precision(3);
        cout << X << " " << Y << endl;
    }
    return 0;
}